{"format": "layers-model", "generatedBy": "keras v3.3.3", "convertedBy": "TensorFlow.js Converter v4.19.0", "modelTopology": {"keras_version": "3.3.3", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": "float32", "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 100], "dtype": "float32", "sparse": false, "name": "input_layer"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 129999, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "negative_slope": 0.3}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 10000, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "negative_slope": 0.3}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1000, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "negative_slope": 0.3}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 1024, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [1024]}}], "build_input_shape": [null, 100]}}, "training_config": {"loss": "mse", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1263.bin", "group1-shard2of1263.bin", "group1-shard3of1263.bin", "group1-shard4of1263.bin", "group1-shard5of1263.bin", "group1-shard6of1263.bin", "group1-shard7of1263.bin", "group1-shard8of1263.bin", "group1-shard9of1263.bin", "group1-shard10of1263.bin", "group1-shard11of1263.bin", "group1-shard12of1263.bin", "group1-shard13of1263.bin", "group1-shard14of1263.bin", "group1-shard15of1263.bin", "group1-shard16of1263.bin", "group1-shard17of1263.bin", "group1-shard18of1263.bin", "group1-shard19of1263.bin", "group1-shard20of1263.bin", "group1-shard21of1263.bin", "group1-shard22of1263.bin", "group1-shard23of1263.bin", "group1-shard24of1263.bin", "group1-shard25of1263.bin", "group1-shard26of1263.bin", "group1-shard27of1263.bin", "group1-shard28of1263.bin", "group1-shard29of1263.bin", "group1-shard30of1263.bin", "group1-shard31of1263.bin", "group1-shard32of1263.bin", "group1-shard33of1263.bin", "group1-shard34of1263.bin", "group1-shard35of1263.bin", "group1-shard36of1263.bin", "group1-shard37of1263.bin", "group1-shard38of1263.bin", "group1-shard39of1263.bin", "group1-shard40of1263.bin", "group1-shard41of1263.bin", "group1-shard42of1263.bin", "group1-shard43of1263.bin", "group1-shard44of1263.bin", "group1-shard45of1263.bin", "group1-shard46of1263.bin", "group1-shard47of1263.bin", "group1-shard48of1263.bin", "group1-shard49of1263.bin", "group1-shard50of1263.bin", "group1-shard51of1263.bin", "group1-shard52of1263.bin", "group1-shard53of1263.bin", "group1-shard54of1263.bin", "group1-shard55of1263.bin", "group1-shard56of1263.bin", "group1-shard57of1263.bin", "group1-shard58of1263.bin", "group1-shard59of1263.bin", "group1-shard60of1263.bin", "group1-shard61of1263.bin", "group1-shard62of1263.bin", "group1-shard63of1263.bin", "group1-shard64of1263.bin", "group1-shard65of1263.bin", "group1-shard66of1263.bin", "group1-shard67of1263.bin", "group1-shard68of1263.bin", "group1-shard69of1263.bin", "group1-shard70of1263.bin", "group1-shard71of1263.bin", "group1-shard72of1263.bin", "group1-shard73of1263.bin", "group1-shard74of1263.bin", "group1-shard75of1263.bin", "group1-shard76of1263.bin", "group1-shard77of1263.bin", "group1-shard78of1263.bin", "group1-shard79of1263.bin", "group1-shard80of1263.bin", "group1-shard81of1263.bin", "group1-shard82of1263.bin", "group1-shard83of1263.bin", "group1-shard84of1263.bin", "group1-shard85of1263.bin", "group1-shard86of1263.bin", "group1-shard87of1263.bin", "group1-shard88of1263.bin", "group1-shard89of1263.bin", "group1-shard90of1263.bin", "group1-shard91of1263.bin", "group1-shard92of1263.bin", "group1-shard93of1263.bin", "group1-shard94of1263.bin", "group1-shard95of1263.bin", "group1-shard96of1263.bin", "group1-shard97of1263.bin", "group1-shard98of1263.bin", "group1-shard99of1263.bin", "group1-shard100of1263.bin", "group1-shard101of1263.bin", "group1-shard102of1263.bin", "group1-shard103of1263.bin", "group1-shard104of1263.bin", "group1-shard105of1263.bin", "group1-shard106of1263.bin", "group1-shard107of1263.bin", "group1-shard108of1263.bin", "group1-shard109of1263.bin", "group1-shard110of1263.bin", "group1-shard111of1263.bin", "group1-shard112of1263.bin", "group1-shard113of1263.bin", "group1-shard114of1263.bin", "group1-shard115of1263.bin", "group1-shard116of1263.bin", "group1-shard117of1263.bin", "group1-shard118of1263.bin", "group1-shard119of1263.bin", "group1-shard120of1263.bin", "group1-shard121of1263.bin", "group1-shard122of1263.bin", "group1-shard123of1263.bin", "group1-shard124of1263.bin", "group1-shard125of1263.bin", "group1-shard126of1263.bin", "group1-shard127of1263.bin", "group1-shard128of1263.bin", "group1-shard129of1263.bin", "group1-shard130of1263.bin", "group1-shard131of1263.bin", "group1-shard132of1263.bin", "group1-shard133of1263.bin", "group1-shard134of1263.bin", "group1-shard135of1263.bin", "group1-shard136of1263.bin", "group1-shard137of1263.bin", "group1-shard138of1263.bin", "group1-shard139of1263.bin", "group1-shard140of1263.bin", "group1-shard141of1263.bin", "group1-shard142of1263.bin", "group1-shard143of1263.bin", "group1-shard144of1263.bin", "group1-shard145of1263.bin", "group1-shard146of1263.bin", "group1-shard147of1263.bin", "group1-shard148of1263.bin", "group1-shard149of1263.bin", "group1-shard150of1263.bin", "group1-shard151of1263.bin", "group1-shard152of1263.bin", "group1-shard153of1263.bin", "group1-shard154of1263.bin", "group1-shard155of1263.bin", "group1-shard156of1263.bin", "group1-shard157of1263.bin", "group1-shard158of1263.bin", "group1-shard159of1263.bin", "group1-shard160of1263.bin", "group1-shard161of1263.bin", "group1-shard162of1263.bin", "group1-shard163of1263.bin", "group1-shard164of1263.bin", "group1-shard165of1263.bin", "group1-shard166of1263.bin", "group1-shard167of1263.bin", "group1-shard168of1263.bin", "group1-shard169of1263.bin", "group1-shard170of1263.bin", "group1-shard171of1263.bin", "group1-shard172of1263.bin", "group1-shard173of1263.bin", "group1-shard174of1263.bin", "group1-shard175of1263.bin", "group1-shard176of1263.bin", "group1-shard177of1263.bin", "group1-shard178of1263.bin", "group1-shard179of1263.bin", "group1-shard180of1263.bin", "group1-shard181of1263.bin", "group1-shard182of1263.bin", "group1-shard183of1263.bin", "group1-shard184of1263.bin", "group1-shard185of1263.bin", "group1-shard186of1263.bin", "group1-shard187of1263.bin", "group1-shard188of1263.bin", "group1-shard189of1263.bin", "group1-shard190of1263.bin", "group1-shard191of1263.bin", "group1-shard192of1263.bin", "group1-shard193of1263.bin", "group1-shard194of1263.bin", "group1-shard195of1263.bin", "group1-shard196of1263.bin", "group1-shard197of1263.bin", "group1-shard198of1263.bin", "group1-shard199of1263.bin", "group1-shard200of1263.bin", "group1-shard201of1263.bin", "group1-shard202of1263.bin", "group1-shard203of1263.bin", "group1-shard204of1263.bin", "group1-shard205of1263.bin", "group1-shard206of1263.bin", "group1-shard207of1263.bin", "group1-shard208of1263.bin", "group1-shard209of1263.bin", "group1-shard210of1263.bin", "group1-shard211of1263.bin", "group1-shard212of1263.bin", "group1-shard213of1263.bin", "group1-shard214of1263.bin", "group1-shard215of1263.bin", "group1-shard216of1263.bin", "group1-shard217of1263.bin", "group1-shard218of1263.bin", "group1-shard219of1263.bin", "group1-shard220of1263.bin", "group1-shard221of1263.bin", "group1-shard222of1263.bin", "group1-shard223of1263.bin", "group1-shard224of1263.bin", "group1-shard225of1263.bin", "group1-shard226of1263.bin", "group1-shard227of1263.bin", "group1-shard228of1263.bin", "group1-shard229of1263.bin", "group1-shard230of1263.bin", "group1-shard231of1263.bin", "group1-shard232of1263.bin", "group1-shard233of1263.bin", "group1-shard234of1263.bin", "group1-shard235of1263.bin", "group1-shard236of1263.bin", "group1-shard237of1263.bin", "group1-shard238of1263.bin", "group1-shard239of1263.bin", "group1-shard240of1263.bin", "group1-shard241of1263.bin", "group1-shard242of1263.bin", "group1-shard243of1263.bin", "group1-shard244of1263.bin", "group1-shard245of1263.bin", "group1-shard246of1263.bin", "group1-shard247of1263.bin", "group1-shard248of1263.bin", "group1-shard249of1263.bin", "group1-shard250of1263.bin", "group1-shard251of1263.bin", "group1-shard252of1263.bin", "group1-shard253of1263.bin", "group1-shard254of1263.bin", "group1-shard255of1263.bin", "group1-shard256of1263.bin", "group1-shard257of1263.bin", "group1-shard258of1263.bin", "group1-shard259of1263.bin", "group1-shard260of1263.bin", "group1-shard261of1263.bin", "group1-shard262of1263.bin", "group1-shard263of1263.bin", "group1-shard264of1263.bin", "group1-shard265of1263.bin", "group1-shard266of1263.bin", "group1-shard267of1263.bin", "group1-shard268of1263.bin", "group1-shard269of1263.bin", "group1-shard270of1263.bin", "group1-shard271of1263.bin", "group1-shard272of1263.bin", "group1-shard273of1263.bin", "group1-shard274of1263.bin", "group1-shard275of1263.bin", "group1-shard276of1263.bin", "group1-shard277of1263.bin", "group1-shard278of1263.bin", "group1-shard279of1263.bin", "group1-shard280of1263.bin", "group1-shard281of1263.bin", "group1-shard282of1263.bin", "group1-shard283of1263.bin", "group1-shard284of1263.bin", "group1-shard285of1263.bin", "group1-shard286of1263.bin", "group1-shard287of1263.bin", "group1-shard288of1263.bin", "group1-shard289of1263.bin", "group1-shard290of1263.bin", "group1-shard291of1263.bin", "group1-shard292of1263.bin", "group1-shard293of1263.bin", "group1-shard294of1263.bin", "group1-shard295of1263.bin", "group1-shard296of1263.bin", "group1-shard297of1263.bin", "group1-shard298of1263.bin", "group1-shard299of1263.bin", "group1-shard300of1263.bin", "group1-shard301of1263.bin", "group1-shard302of1263.bin", "group1-shard303of1263.bin", "group1-shard304of1263.bin", "group1-shard305of1263.bin", "group1-shard306of1263.bin", "group1-shard307of1263.bin", "group1-shard308of1263.bin", "group1-shard309of1263.bin", "group1-shard310of1263.bin", "group1-shard311of1263.bin", "group1-shard312of1263.bin", "group1-shard313of1263.bin", "group1-shard314of1263.bin", "group1-shard315of1263.bin", "group1-shard316of1263.bin", "group1-shard317of1263.bin", "group1-shard318of1263.bin", "group1-shard319of1263.bin", "group1-shard320of1263.bin", "group1-shard321of1263.bin", "group1-shard322of1263.bin", "group1-shard323of1263.bin", "group1-shard324of1263.bin", "group1-shard325of1263.bin", "group1-shard326of1263.bin", "group1-shard327of1263.bin", "group1-shard328of1263.bin", "group1-shard329of1263.bin", "group1-shard330of1263.bin", "group1-shard331of1263.bin", "group1-shard332of1263.bin", "group1-shard333of1263.bin", "group1-shard334of1263.bin", "group1-shard335of1263.bin", "group1-shard336of1263.bin", "group1-shard337of1263.bin", "group1-shard338of1263.bin", "group1-shard339of1263.bin", "group1-shard340of1263.bin", "group1-shard341of1263.bin", "group1-shard342of1263.bin", "group1-shard343of1263.bin", "group1-shard344of1263.bin", "group1-shard345of1263.bin", "group1-shard346of1263.bin", "group1-shard347of1263.bin", "group1-shard348of1263.bin", "group1-shard349of1263.bin", "group1-shard350of1263.bin", "group1-shard351of1263.bin", "group1-shard352of1263.bin", "group1-shard353of1263.bin", "group1-shard354of1263.bin", "group1-shard355of1263.bin", "group1-shard356of1263.bin", "group1-shard357of1263.bin", "group1-shard358of1263.bin", "group1-shard359of1263.bin", "group1-shard360of1263.bin", "group1-shard361of1263.bin", "group1-shard362of1263.bin", "group1-shard363of1263.bin", "group1-shard364of1263.bin", "group1-shard365of1263.bin", "group1-shard366of1263.bin", "group1-shard367of1263.bin", "group1-shard368of1263.bin", "group1-shard369of1263.bin", "group1-shard370of1263.bin", "group1-shard371of1263.bin", "group1-shard372of1263.bin", "group1-shard373of1263.bin", "group1-shard374of1263.bin", "group1-shard375of1263.bin", "group1-shard376of1263.bin", "group1-shard377of1263.bin", "group1-shard378of1263.bin", "group1-shard379of1263.bin", "group1-shard380of1263.bin", "group1-shard381of1263.bin", "group1-shard382of1263.bin", "group1-shard383of1263.bin", "group1-shard384of1263.bin", "group1-shard385of1263.bin", "group1-shard386of1263.bin", "group1-shard387of1263.bin", "group1-shard388of1263.bin", "group1-shard389of1263.bin", "group1-shard390of1263.bin", "group1-shard391of1263.bin", "group1-shard392of1263.bin", "group1-shard393of1263.bin", "group1-shard394of1263.bin", "group1-shard395of1263.bin", "group1-shard396of1263.bin", "group1-shard397of1263.bin", "group1-shard398of1263.bin", "group1-shard399of1263.bin", "group1-shard400of1263.bin", "group1-shard401of1263.bin", "group1-shard402of1263.bin", "group1-shard403of1263.bin", "group1-shard404of1263.bin", "group1-shard405of1263.bin", "group1-shard406of1263.bin", "group1-shard407of1263.bin", "group1-shard408of1263.bin", "group1-shard409of1263.bin", "group1-shard410of1263.bin", "group1-shard411of1263.bin", "group1-shard412of1263.bin", "group1-shard413of1263.bin", "group1-shard414of1263.bin", "group1-shard415of1263.bin", "group1-shard416of1263.bin", "group1-shard417of1263.bin", "group1-shard418of1263.bin", "group1-shard419of1263.bin", "group1-shard420of1263.bin", "group1-shard421of1263.bin", "group1-shard422of1263.bin", "group1-shard423of1263.bin", "group1-shard424of1263.bin", "group1-shard425of1263.bin", "group1-shard426of1263.bin", "group1-shard427of1263.bin", "group1-shard428of1263.bin", "group1-shard429of1263.bin", "group1-shard430of1263.bin", "group1-shard431of1263.bin", "group1-shard432of1263.bin", "group1-shard433of1263.bin", "group1-shard434of1263.bin", "group1-shard435of1263.bin", "group1-shard436of1263.bin", "group1-shard437of1263.bin", "group1-shard438of1263.bin", "group1-shard439of1263.bin", "group1-shard440of1263.bin", "group1-shard441of1263.bin", "group1-shard442of1263.bin", "group1-shard443of1263.bin", "group1-shard444of1263.bin", "group1-shard445of1263.bin", "group1-shard446of1263.bin", "group1-shard447of1263.bin", "group1-shard448of1263.bin", "group1-shard449of1263.bin", "group1-shard450of1263.bin", "group1-shard451of1263.bin", "group1-shard452of1263.bin", "group1-shard453of1263.bin", "group1-shard454of1263.bin", "group1-shard455of1263.bin", "group1-shard456of1263.bin", "group1-shard457of1263.bin", "group1-shard458of1263.bin", "group1-shard459of1263.bin", "group1-shard460of1263.bin", "group1-shard461of1263.bin", "group1-shard462of1263.bin", "group1-shard463of1263.bin", "group1-shard464of1263.bin", "group1-shard465of1263.bin", "group1-shard466of1263.bin", "group1-shard467of1263.bin", "group1-shard468of1263.bin", "group1-shard469of1263.bin", "group1-shard470of1263.bin", "group1-shard471of1263.bin", "group1-shard472of1263.bin", "group1-shard473of1263.bin", "group1-shard474of1263.bin", "group1-shard475of1263.bin", "group1-shard476of1263.bin", "group1-shard477of1263.bin", "group1-shard478of1263.bin", "group1-shard479of1263.bin", "group1-shard480of1263.bin", "group1-shard481of1263.bin", "group1-shard482of1263.bin", "group1-shard483of1263.bin", "group1-shard484of1263.bin", "group1-shard485of1263.bin", "group1-shard486of1263.bin", "group1-shard487of1263.bin", "group1-shard488of1263.bin", "group1-shard489of1263.bin", "group1-shard490of1263.bin", "group1-shard491of1263.bin", "group1-shard492of1263.bin", "group1-shard493of1263.bin", "group1-shard494of1263.bin", "group1-shard495of1263.bin", "group1-shard496of1263.bin", "group1-shard497of1263.bin", "group1-shard498of1263.bin", "group1-shard499of1263.bin", "group1-shard500of1263.bin", "group1-shard501of1263.bin", "group1-shard502of1263.bin", "group1-shard503of1263.bin", "group1-shard504of1263.bin", "group1-shard505of1263.bin", "group1-shard506of1263.bin", "group1-shard507of1263.bin", "group1-shard508of1263.bin", "group1-shard509of1263.bin", "group1-shard510of1263.bin", "group1-shard511of1263.bin", "group1-shard512of1263.bin", "group1-shard513of1263.bin", "group1-shard514of1263.bin", "group1-shard515of1263.bin", "group1-shard516of1263.bin", "group1-shard517of1263.bin", "group1-shard518of1263.bin", "group1-shard519of1263.bin", "group1-shard520of1263.bin", "group1-shard521of1263.bin", "group1-shard522of1263.bin", "group1-shard523of1263.bin", "group1-shard524of1263.bin", "group1-shard525of1263.bin", "group1-shard526of1263.bin", "group1-shard527of1263.bin", "group1-shard528of1263.bin", "group1-shard529of1263.bin", "group1-shard530of1263.bin", "group1-shard531of1263.bin", "group1-shard532of1263.bin", "group1-shard533of1263.bin", "group1-shard534of1263.bin", "group1-shard535of1263.bin", "group1-shard536of1263.bin", "group1-shard537of1263.bin", "group1-shard538of1263.bin", "group1-shard539of1263.bin", "group1-shard540of1263.bin", "group1-shard541of1263.bin", "group1-shard542of1263.bin", "group1-shard543of1263.bin", "group1-shard544of1263.bin", "group1-shard545of1263.bin", "group1-shard546of1263.bin", "group1-shard547of1263.bin", "group1-shard548of1263.bin", "group1-shard549of1263.bin", "group1-shard550of1263.bin", "group1-shard551of1263.bin", "group1-shard552of1263.bin", "group1-shard553of1263.bin", "group1-shard554of1263.bin", "group1-shard555of1263.bin", "group1-shard556of1263.bin", "group1-shard557of1263.bin", "group1-shard558of1263.bin", "group1-shard559of1263.bin", "group1-shard560of1263.bin", "group1-shard561of1263.bin", "group1-shard562of1263.bin", "group1-shard563of1263.bin", "group1-shard564of1263.bin", "group1-shard565of1263.bin", "group1-shard566of1263.bin", "group1-shard567of1263.bin", "group1-shard568of1263.bin", "group1-shard569of1263.bin", "group1-shard570of1263.bin", "group1-shard571of1263.bin", "group1-shard572of1263.bin", "group1-shard573of1263.bin", "group1-shard574of1263.bin", "group1-shard575of1263.bin", "group1-shard576of1263.bin", "group1-shard577of1263.bin", "group1-shard578of1263.bin", "group1-shard579of1263.bin", "group1-shard580of1263.bin", "group1-shard581of1263.bin", "group1-shard582of1263.bin", "group1-shard583of1263.bin", "group1-shard584of1263.bin", "group1-shard585of1263.bin", "group1-shard586of1263.bin", "group1-shard587of1263.bin", "group1-shard588of1263.bin", "group1-shard589of1263.bin", "group1-shard590of1263.bin", "group1-shard591of1263.bin", "group1-shard592of1263.bin", "group1-shard593of1263.bin", "group1-shard594of1263.bin", "group1-shard595of1263.bin", "group1-shard596of1263.bin", "group1-shard597of1263.bin", "group1-shard598of1263.bin", "group1-shard599of1263.bin", "group1-shard600of1263.bin", "group1-shard601of1263.bin", "group1-shard602of1263.bin", "group1-shard603of1263.bin", "group1-shard604of1263.bin", "group1-shard605of1263.bin", "group1-shard606of1263.bin", "group1-shard607of1263.bin", "group1-shard608of1263.bin", "group1-shard609of1263.bin", "group1-shard610of1263.bin", "group1-shard611of1263.bin", "group1-shard612of1263.bin", "group1-shard613of1263.bin", "group1-shard614of1263.bin", "group1-shard615of1263.bin", "group1-shard616of1263.bin", "group1-shard617of1263.bin", "group1-shard618of1263.bin", "group1-shard619of1263.bin", "group1-shard620of1263.bin", "group1-shard621of1263.bin", "group1-shard622of1263.bin", "group1-shard623of1263.bin", "group1-shard624of1263.bin", "group1-shard625of1263.bin", "group1-shard626of1263.bin", "group1-shard627of1263.bin", "group1-shard628of1263.bin", "group1-shard629of1263.bin", "group1-shard630of1263.bin", "group1-shard631of1263.bin", "group1-shard632of1263.bin", "group1-shard633of1263.bin", "group1-shard634of1263.bin", "group1-shard635of1263.bin", "group1-shard636of1263.bin", "group1-shard637of1263.bin", "group1-shard638of1263.bin", "group1-shard639of1263.bin", "group1-shard640of1263.bin", "group1-shard641of1263.bin", "group1-shard642of1263.bin", "group1-shard643of1263.bin", "group1-shard644of1263.bin", "group1-shard645of1263.bin", "group1-shard646of1263.bin", "group1-shard647of1263.bin", "group1-shard648of1263.bin", "group1-shard649of1263.bin", "group1-shard650of1263.bin", "group1-shard651of1263.bin", "group1-shard652of1263.bin", "group1-shard653of1263.bin", "group1-shard654of1263.bin", "group1-shard655of1263.bin", "group1-shard656of1263.bin", "group1-shard657of1263.bin", "group1-shard658of1263.bin", "group1-shard659of1263.bin", "group1-shard660of1263.bin", "group1-shard661of1263.bin", "group1-shard662of1263.bin", "group1-shard663of1263.bin", "group1-shard664of1263.bin", "group1-shard665of1263.bin", "group1-shard666of1263.bin", "group1-shard667of1263.bin", "group1-shard668of1263.bin", "group1-shard669of1263.bin", "group1-shard670of1263.bin", "group1-shard671of1263.bin", "group1-shard672of1263.bin", "group1-shard673of1263.bin", "group1-shard674of1263.bin", "group1-shard675of1263.bin", "group1-shard676of1263.bin", "group1-shard677of1263.bin", "group1-shard678of1263.bin", "group1-shard679of1263.bin", "group1-shard680of1263.bin", "group1-shard681of1263.bin", "group1-shard682of1263.bin", "group1-shard683of1263.bin", "group1-shard684of1263.bin", "group1-shard685of1263.bin", "group1-shard686of1263.bin", "group1-shard687of1263.bin", "group1-shard688of1263.bin", "group1-shard689of1263.bin", "group1-shard690of1263.bin", "group1-shard691of1263.bin", "group1-shard692of1263.bin", "group1-shard693of1263.bin", "group1-shard694of1263.bin", "group1-shard695of1263.bin", "group1-shard696of1263.bin", "group1-shard697of1263.bin", "group1-shard698of1263.bin", "group1-shard699of1263.bin", "group1-shard700of1263.bin", "group1-shard701of1263.bin", "group1-shard702of1263.bin", "group1-shard703of1263.bin", "group1-shard704of1263.bin", "group1-shard705of1263.bin", "group1-shard706of1263.bin", "group1-shard707of1263.bin", "group1-shard708of1263.bin", "group1-shard709of1263.bin", "group1-shard710of1263.bin", "group1-shard711of1263.bin", "group1-shard712of1263.bin", "group1-shard713of1263.bin", "group1-shard714of1263.bin", "group1-shard715of1263.bin", "group1-shard716of1263.bin", "group1-shard717of1263.bin", "group1-shard718of1263.bin", "group1-shard719of1263.bin", "group1-shard720of1263.bin", "group1-shard721of1263.bin", "group1-shard722of1263.bin", "group1-shard723of1263.bin", "group1-shard724of1263.bin", "group1-shard725of1263.bin", "group1-shard726of1263.bin", "group1-shard727of1263.bin", "group1-shard728of1263.bin", "group1-shard729of1263.bin", "group1-shard730of1263.bin", "group1-shard731of1263.bin", "group1-shard732of1263.bin", "group1-shard733of1263.bin", "group1-shard734of1263.bin", "group1-shard735of1263.bin", "group1-shard736of1263.bin", "group1-shard737of1263.bin", "group1-shard738of1263.bin", "group1-shard739of1263.bin", "group1-shard740of1263.bin", "group1-shard741of1263.bin", "group1-shard742of1263.bin", "group1-shard743of1263.bin", "group1-shard744of1263.bin", "group1-shard745of1263.bin", "group1-shard746of1263.bin", "group1-shard747of1263.bin", "group1-shard748of1263.bin", "group1-shard749of1263.bin", "group1-shard750of1263.bin", "group1-shard751of1263.bin", "group1-shard752of1263.bin", "group1-shard753of1263.bin", "group1-shard754of1263.bin", "group1-shard755of1263.bin", "group1-shard756of1263.bin", "group1-shard757of1263.bin", "group1-shard758of1263.bin", "group1-shard759of1263.bin", "group1-shard760of1263.bin", "group1-shard761of1263.bin", "group1-shard762of1263.bin", "group1-shard763of1263.bin", "group1-shard764of1263.bin", "group1-shard765of1263.bin", "group1-shard766of1263.bin", "group1-shard767of1263.bin", "group1-shard768of1263.bin", "group1-shard769of1263.bin", "group1-shard770of1263.bin", "group1-shard771of1263.bin", "group1-shard772of1263.bin", "group1-shard773of1263.bin", "group1-shard774of1263.bin", "group1-shard775of1263.bin", "group1-shard776of1263.bin", "group1-shard777of1263.bin", "group1-shard778of1263.bin", "group1-shard779of1263.bin", "group1-shard780of1263.bin", "group1-shard781of1263.bin", "group1-shard782of1263.bin", "group1-shard783of1263.bin", "group1-shard784of1263.bin", "group1-shard785of1263.bin", "group1-shard786of1263.bin", "group1-shard787of1263.bin", "group1-shard788of1263.bin", "group1-shard789of1263.bin", "group1-shard790of1263.bin", "group1-shard791of1263.bin", "group1-shard792of1263.bin", "group1-shard793of1263.bin", "group1-shard794of1263.bin", "group1-shard795of1263.bin", "group1-shard796of1263.bin", "group1-shard797of1263.bin", "group1-shard798of1263.bin", "group1-shard799of1263.bin", "group1-shard800of1263.bin", "group1-shard801of1263.bin", "group1-shard802of1263.bin", "group1-shard803of1263.bin", "group1-shard804of1263.bin", "group1-shard805of1263.bin", "group1-shard806of1263.bin", "group1-shard807of1263.bin", "group1-shard808of1263.bin", "group1-shard809of1263.bin", "group1-shard810of1263.bin", "group1-shard811of1263.bin", "group1-shard812of1263.bin", "group1-shard813of1263.bin", "group1-shard814of1263.bin", "group1-shard815of1263.bin", "group1-shard816of1263.bin", "group1-shard817of1263.bin", "group1-shard818of1263.bin", "group1-shard819of1263.bin", "group1-shard820of1263.bin", "group1-shard821of1263.bin", "group1-shard822of1263.bin", "group1-shard823of1263.bin", "group1-shard824of1263.bin", "group1-shard825of1263.bin", "group1-shard826of1263.bin", "group1-shard827of1263.bin", "group1-shard828of1263.bin", "group1-shard829of1263.bin", "group1-shard830of1263.bin", "group1-shard831of1263.bin", "group1-shard832of1263.bin", "group1-shard833of1263.bin", "group1-shard834of1263.bin", "group1-shard835of1263.bin", "group1-shard836of1263.bin", "group1-shard837of1263.bin", "group1-shard838of1263.bin", "group1-shard839of1263.bin", "group1-shard840of1263.bin", "group1-shard841of1263.bin", "group1-shard842of1263.bin", "group1-shard843of1263.bin", "group1-shard844of1263.bin", "group1-shard845of1263.bin", "group1-shard846of1263.bin", "group1-shard847of1263.bin", "group1-shard848of1263.bin", "group1-shard849of1263.bin", "group1-shard850of1263.bin", "group1-shard851of1263.bin", "group1-shard852of1263.bin", "group1-shard853of1263.bin", "group1-shard854of1263.bin", "group1-shard855of1263.bin", "group1-shard856of1263.bin", "group1-shard857of1263.bin", "group1-shard858of1263.bin", "group1-shard859of1263.bin", "group1-shard860of1263.bin", "group1-shard861of1263.bin", "group1-shard862of1263.bin", "group1-shard863of1263.bin", "group1-shard864of1263.bin", "group1-shard865of1263.bin", "group1-shard866of1263.bin", "group1-shard867of1263.bin", "group1-shard868of1263.bin", "group1-shard869of1263.bin", "group1-shard870of1263.bin", "group1-shard871of1263.bin", "group1-shard872of1263.bin", "group1-shard873of1263.bin", "group1-shard874of1263.bin", "group1-shard875of1263.bin", "group1-shard876of1263.bin", "group1-shard877of1263.bin", "group1-shard878of1263.bin", "group1-shard879of1263.bin", "group1-shard880of1263.bin", "group1-shard881of1263.bin", "group1-shard882of1263.bin", "group1-shard883of1263.bin", "group1-shard884of1263.bin", "group1-shard885of1263.bin", "group1-shard886of1263.bin", "group1-shard887of1263.bin", "group1-shard888of1263.bin", "group1-shard889of1263.bin", "group1-shard890of1263.bin", "group1-shard891of1263.bin", "group1-shard892of1263.bin", "group1-shard893of1263.bin", "group1-shard894of1263.bin", "group1-shard895of1263.bin", "group1-shard896of1263.bin", "group1-shard897of1263.bin", "group1-shard898of1263.bin", "group1-shard899of1263.bin", "group1-shard900of1263.bin", "group1-shard901of1263.bin", "group1-shard902of1263.bin", "group1-shard903of1263.bin", "group1-shard904of1263.bin", "group1-shard905of1263.bin", "group1-shard906of1263.bin", "group1-shard907of1263.bin", "group1-shard908of1263.bin", "group1-shard909of1263.bin", "group1-shard910of1263.bin", "group1-shard911of1263.bin", "group1-shard912of1263.bin", "group1-shard913of1263.bin", "group1-shard914of1263.bin", "group1-shard915of1263.bin", "group1-shard916of1263.bin", "group1-shard917of1263.bin", "group1-shard918of1263.bin", "group1-shard919of1263.bin", "group1-shard920of1263.bin", "group1-shard921of1263.bin", "group1-shard922of1263.bin", "group1-shard923of1263.bin", "group1-shard924of1263.bin", "group1-shard925of1263.bin", "group1-shard926of1263.bin", "group1-shard927of1263.bin", "group1-shard928of1263.bin", "group1-shard929of1263.bin", "group1-shard930of1263.bin", "group1-shard931of1263.bin", "group1-shard932of1263.bin", "group1-shard933of1263.bin", "group1-shard934of1263.bin", "group1-shard935of1263.bin", "group1-shard936of1263.bin", "group1-shard937of1263.bin", "group1-shard938of1263.bin", "group1-shard939of1263.bin", "group1-shard940of1263.bin", "group1-shard941of1263.bin", "group1-shard942of1263.bin", "group1-shard943of1263.bin", "group1-shard944of1263.bin", "group1-shard945of1263.bin", "group1-shard946of1263.bin", "group1-shard947of1263.bin", "group1-shard948of1263.bin", "group1-shard949of1263.bin", "group1-shard950of1263.bin", "group1-shard951of1263.bin", "group1-shard952of1263.bin", "group1-shard953of1263.bin", "group1-shard954of1263.bin", "group1-shard955of1263.bin", "group1-shard956of1263.bin", "group1-shard957of1263.bin", "group1-shard958of1263.bin", "group1-shard959of1263.bin", "group1-shard960of1263.bin", "group1-shard961of1263.bin", "group1-shard962of1263.bin", "group1-shard963of1263.bin", "group1-shard964of1263.bin", "group1-shard965of1263.bin", "group1-shard966of1263.bin", "group1-shard967of1263.bin", "group1-shard968of1263.bin", "group1-shard969of1263.bin", "group1-shard970of1263.bin", "group1-shard971of1263.bin", "group1-shard972of1263.bin", "group1-shard973of1263.bin", "group1-shard974of1263.bin", "group1-shard975of1263.bin", "group1-shard976of1263.bin", "group1-shard977of1263.bin", "group1-shard978of1263.bin", "group1-shard979of1263.bin", "group1-shard980of1263.bin", "group1-shard981of1263.bin", "group1-shard982of1263.bin", "group1-shard983of1263.bin", "group1-shard984of1263.bin", "group1-shard985of1263.bin", "group1-shard986of1263.bin", "group1-shard987of1263.bin", "group1-shard988of1263.bin", "group1-shard989of1263.bin", "group1-shard990of1263.bin", "group1-shard991of1263.bin", "group1-shard992of1263.bin", "group1-shard993of1263.bin", "group1-shard994of1263.bin", "group1-shard995of1263.bin", "group1-shard996of1263.bin", "group1-shard997of1263.bin", "group1-shard998of1263.bin", "group1-shard999of1263.bin", "group1-shard1000of1263.bin", "group1-shard1001of1263.bin", "group1-shard1002of1263.bin", "group1-shard1003of1263.bin", "group1-shard1004of1263.bin", "group1-shard1005of1263.bin", "group1-shard1006of1263.bin", "group1-shard1007of1263.bin", "group1-shard1008of1263.bin", "group1-shard1009of1263.bin", "group1-shard1010of1263.bin", "group1-shard1011of1263.bin", "group1-shard1012of1263.bin", "group1-shard1013of1263.bin", "group1-shard1014of1263.bin", "group1-shard1015of1263.bin", "group1-shard1016of1263.bin", "group1-shard1017of1263.bin", "group1-shard1018of1263.bin", "group1-shard1019of1263.bin", "group1-shard1020of1263.bin", "group1-shard1021of1263.bin", "group1-shard1022of1263.bin", "group1-shard1023of1263.bin", "group1-shard1024of1263.bin", "group1-shard1025of1263.bin", "group1-shard1026of1263.bin", "group1-shard1027of1263.bin", "group1-shard1028of1263.bin", "group1-shard1029of1263.bin", "group1-shard1030of1263.bin", "group1-shard1031of1263.bin", "group1-shard1032of1263.bin", "group1-shard1033of1263.bin", "group1-shard1034of1263.bin", "group1-shard1035of1263.bin", "group1-shard1036of1263.bin", "group1-shard1037of1263.bin", "group1-shard1038of1263.bin", "group1-shard1039of1263.bin", "group1-shard1040of1263.bin", "group1-shard1041of1263.bin", "group1-shard1042of1263.bin", "group1-shard1043of1263.bin", "group1-shard1044of1263.bin", "group1-shard1045of1263.bin", "group1-shard1046of1263.bin", "group1-shard1047of1263.bin", "group1-shard1048of1263.bin", "group1-shard1049of1263.bin", "group1-shard1050of1263.bin", "group1-shard1051of1263.bin", "group1-shard1052of1263.bin", "group1-shard1053of1263.bin", "group1-shard1054of1263.bin", "group1-shard1055of1263.bin", "group1-shard1056of1263.bin", "group1-shard1057of1263.bin", "group1-shard1058of1263.bin", "group1-shard1059of1263.bin", "group1-shard1060of1263.bin", "group1-shard1061of1263.bin", "group1-shard1062of1263.bin", "group1-shard1063of1263.bin", "group1-shard1064of1263.bin", "group1-shard1065of1263.bin", "group1-shard1066of1263.bin", "group1-shard1067of1263.bin", "group1-shard1068of1263.bin", "group1-shard1069of1263.bin", "group1-shard1070of1263.bin", "group1-shard1071of1263.bin", "group1-shard1072of1263.bin", "group1-shard1073of1263.bin", "group1-shard1074of1263.bin", "group1-shard1075of1263.bin", "group1-shard1076of1263.bin", "group1-shard1077of1263.bin", "group1-shard1078of1263.bin", "group1-shard1079of1263.bin", "group1-shard1080of1263.bin", "group1-shard1081of1263.bin", "group1-shard1082of1263.bin", "group1-shard1083of1263.bin", "group1-shard1084of1263.bin", "group1-shard1085of1263.bin", "group1-shard1086of1263.bin", "group1-shard1087of1263.bin", "group1-shard1088of1263.bin", "group1-shard1089of1263.bin", "group1-shard1090of1263.bin", "group1-shard1091of1263.bin", "group1-shard1092of1263.bin", "group1-shard1093of1263.bin", "group1-shard1094of1263.bin", "group1-shard1095of1263.bin", "group1-shard1096of1263.bin", "group1-shard1097of1263.bin", "group1-shard1098of1263.bin", "group1-shard1099of1263.bin", "group1-shard1100of1263.bin", "group1-shard1101of1263.bin", "group1-shard1102of1263.bin", "group1-shard1103of1263.bin", "group1-shard1104of1263.bin", "group1-shard1105of1263.bin", "group1-shard1106of1263.bin", "group1-shard1107of1263.bin", "group1-shard1108of1263.bin", "group1-shard1109of1263.bin", "group1-shard1110of1263.bin", "group1-shard1111of1263.bin", "group1-shard1112of1263.bin", "group1-shard1113of1263.bin", "group1-shard1114of1263.bin", "group1-shard1115of1263.bin", "group1-shard1116of1263.bin", "group1-shard1117of1263.bin", "group1-shard1118of1263.bin", "group1-shard1119of1263.bin", "group1-shard1120of1263.bin", "group1-shard1121of1263.bin", "group1-shard1122of1263.bin", "group1-shard1123of1263.bin", "group1-shard1124of1263.bin", "group1-shard1125of1263.bin", "group1-shard1126of1263.bin", "group1-shard1127of1263.bin", "group1-shard1128of1263.bin", "group1-shard1129of1263.bin", "group1-shard1130of1263.bin", "group1-shard1131of1263.bin", "group1-shard1132of1263.bin", "group1-shard1133of1263.bin", "group1-shard1134of1263.bin", "group1-shard1135of1263.bin", "group1-shard1136of1263.bin", "group1-shard1137of1263.bin", "group1-shard1138of1263.bin", "group1-shard1139of1263.bin", "group1-shard1140of1263.bin", "group1-shard1141of1263.bin", "group1-shard1142of1263.bin", "group1-shard1143of1263.bin", "group1-shard1144of1263.bin", "group1-shard1145of1263.bin", "group1-shard1146of1263.bin", "group1-shard1147of1263.bin", "group1-shard1148of1263.bin", "group1-shard1149of1263.bin", "group1-shard1150of1263.bin", "group1-shard1151of1263.bin", "group1-shard1152of1263.bin", "group1-shard1153of1263.bin", "group1-shard1154of1263.bin", "group1-shard1155of1263.bin", "group1-shard1156of1263.bin", "group1-shard1157of1263.bin", "group1-shard1158of1263.bin", "group1-shard1159of1263.bin", "group1-shard1160of1263.bin", "group1-shard1161of1263.bin", "group1-shard1162of1263.bin", "group1-shard1163of1263.bin", "group1-shard1164of1263.bin", "group1-shard1165of1263.bin", "group1-shard1166of1263.bin", "group1-shard1167of1263.bin", "group1-shard1168of1263.bin", "group1-shard1169of1263.bin", "group1-shard1170of1263.bin", "group1-shard1171of1263.bin", "group1-shard1172of1263.bin", "group1-shard1173of1263.bin", "group1-shard1174of1263.bin", "group1-shard1175of1263.bin", "group1-shard1176of1263.bin", "group1-shard1177of1263.bin", "group1-shard1178of1263.bin", "group1-shard1179of1263.bin", "group1-shard1180of1263.bin", "group1-shard1181of1263.bin", "group1-shard1182of1263.bin", "group1-shard1183of1263.bin", "group1-shard1184of1263.bin", "group1-shard1185of1263.bin", "group1-shard1186of1263.bin", "group1-shard1187of1263.bin", "group1-shard1188of1263.bin", "group1-shard1189of1263.bin", "group1-shard1190of1263.bin", "group1-shard1191of1263.bin", "group1-shard1192of1263.bin", "group1-shard1193of1263.bin", "group1-shard1194of1263.bin", "group1-shard1195of1263.bin", "group1-shard1196of1263.bin", "group1-shard1197of1263.bin", "group1-shard1198of1263.bin", "group1-shard1199of1263.bin", "group1-shard1200of1263.bin", "group1-shard1201of1263.bin", "group1-shard1202of1263.bin", "group1-shard1203of1263.bin", "group1-shard1204of1263.bin", "group1-shard1205of1263.bin", "group1-shard1206of1263.bin", "group1-shard1207of1263.bin", "group1-shard1208of1263.bin", "group1-shard1209of1263.bin", "group1-shard1210of1263.bin", "group1-shard1211of1263.bin", "group1-shard1212of1263.bin", "group1-shard1213of1263.bin", "group1-shard1214of1263.bin", "group1-shard1215of1263.bin", "group1-shard1216of1263.bin", "group1-shard1217of1263.bin", "group1-shard1218of1263.bin", "group1-shard1219of1263.bin", "group1-shard1220of1263.bin", "group1-shard1221of1263.bin", "group1-shard1222of1263.bin", "group1-shard1223of1263.bin", "group1-shard1224of1263.bin", "group1-shard1225of1263.bin", "group1-shard1226of1263.bin", "group1-shard1227of1263.bin", "group1-shard1228of1263.bin", "group1-shard1229of1263.bin", "group1-shard1230of1263.bin", "group1-shard1231of1263.bin", "group1-shard1232of1263.bin", "group1-shard1233of1263.bin", "group1-shard1234of1263.bin", "group1-shard1235of1263.bin", "group1-shard1236of1263.bin", "group1-shard1237of1263.bin", "group1-shard1238of1263.bin", "group1-shard1239of1263.bin", "group1-shard1240of1263.bin", "group1-shard1241of1263.bin", "group1-shard1242of1263.bin", "group1-shard1243of1263.bin", "group1-shard1244of1263.bin", "group1-shard1245of1263.bin", "group1-shard1246of1263.bin", "group1-shard1247of1263.bin", "group1-shard1248of1263.bin", "group1-shard1249of1263.bin", "group1-shard1250of1263.bin", "group1-shard1251of1263.bin", "group1-shard1252of1263.bin", "group1-shard1253of1263.bin", "group1-shard1254of1263.bin", "group1-shard1255of1263.bin", "group1-shard1256of1263.bin", "group1-shard1257of1263.bin", "group1-shard1258of1263.bin", "group1-shard1259of1263.bin", "group1-shard1260of1263.bin", "group1-shard1261of1263.bin", "group1-shard1262of1263.bin", "group1-shard1263of1263.bin"], "weights": [{"name": "sequential/dense/kernel", "shape": [100, 129999], "dtype": "float32"}, {"name": "sequential/dense/bias", "shape": [129999], "dtype": "float32"}, {"name": "sequential/dense_1/kernel", "shape": [129999, 10000], "dtype": "float32"}, {"name": "sequential/dense_1/bias", "shape": [10000], "dtype": "float32"}, {"name": "sequential/dense_2/kernel", "shape": [10000, 1000], "dtype": "float32"}, {"name": "sequential/dense_2/bias", "shape": [1000], "dtype": "float32"}, {"name": "sequential/dense_3/kernel", "shape": [1000, 1024], "dtype": "float32"}, {"name": "sequential/dense_3/bias", "shape": [1024], "dtype": "float32"}]}]}